{
    "name": "ListView",
    "directory": "listview",
    "category": "Layout",
    "ftName" : "listview",
    "samples": [
        {
            "url": "default",
            "name": "Default Functionalities",
            "category": "ListView",
            "description":"Demo of Essential JS 2 ListView control default renderings of flat and group list views. Click any list item to select and highlight it."
        },
        {
            "url": "remote-list",
            "name": "Remote List",
            "category": "ListView",
            "description":"Demo of Essential JS 2 ListView control rendering the list view with remote data, which uses DataManager and query properties to fetch data."
        },
        {
            "url": "checklist",
            "name": "Checklist",
            "category": "ListView",
            "description":"Essential JS 2 ListView control demo of the checked list view, which supports selecting more than one list item."
        },
        {
            "url": "nested-list",
            "name": "Nested List",
            "category": "ListView",
            "description":"Demo of Essential JS 2 ListView control showing the visual representation of nested data using the child property."
        },
        {
            "url": "virtualization",
            "name": "Virtualization",
            "category": "ListView",
            "description":"Demo of Essential JS 2 ListView control loading items in the view port with virtualization, which improves performance when loading large amounts of data."
        },
        {
            "url": "template",
            "name": "Template",
            "category": "Customization",
            "description":"Demo of Essential JS 2 ListView control rendering customized elements inside list items. This sample is a news feed application built using a list view.",
            "sourceFiles": [
                {"displayName": "template.vue", "path": "./src/listview/template.vue"},
                {"displayName": "list-template.vue", "path": "./src/listview/list-template.vue"}
            ]
        },
        {
            "url": "group-template",
            "name": "Group Template",
            "category": "Customization",
            "description":"Essential JS 2 ListView control demo of list item and header customization using a template. The mobile settings showcase built-in CSS."
        },
        {
            "url": "call-history",
            "name": "Call History",
            "category": "Use Case",
            "description":"Demo of Essential JS 2 ListView control in a real-world use case as a call history app, featuring mobile contacts, mail inbox, and more."
        }
    ]
}
